docs/internal/openfoam13-marine-smoke/DTCHullMoving/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format     ascii;
    class     dictionary;
    object     dynamicMeshDict;
}

mover
{
    type motionSolver;
    libs ("librigidBodyMeshMotion.so");
    motionSolver rigidBodyMotion;
    report on;
    solver
    {
        type Newmark;
    }
    accelerationRelaxation 0.4;
    bodies
    {
        hull
        {
            type rigidBody;
            parent root;
            centreOfMass (2.929541 0.0 0.2);
            mass 412.73;
            inertia (40.0 0.0 0.0 921.0 0.0 921.0);
            transform (1 0 0 0 1 0 0 0 1) (0.0 0.0 0.0);
            joint
            {
                type composite;
                joints (
        { type Pz; }
        { type Ry; }
);
            }
            patches (hull);
            innerDistance 0.3;
            outerDistance 1;
        }
    }
    restraints
    {
        translationDamper
        {
            type linearDamper;
            body hull;
            coeff 8596;
        }
        rotationDamper
        {
            type sphericalAngularDamper;
            body hull;
            coeff 11586;
        }
    }
}
